{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Desktop\GitHub\Stata\michigan-graph-scheme\index.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}16 Feb 2025, 13:03:12
{txt}
{com}. //_1
. display c(current_date)
{res}16 Feb 2025
{txt}
{com}. //_2
. display c(current_time)
{res}13:03:12
{txt}
{com}. //_3q
. 
. clear all
{res}{txt}
{com}. 
. quietly set obs 9
{txt}
{com}. 
. generate x = _n
{txt}
{com}.     
. quietly save "graphdemo.dta", replace
{txt}
{com}. 
. graph bar (count), ///
> over(x, axis(off)) asyvars ///
> ytitle(" ") ylabel(none) ///
> yscale(lcolor(none)) ///
> title(Michigan Graph Scheme Colors) ///
> scheme(michigan) ///
> ysize(1.5) scale(2) ///
> name(michigan, replace)
{res}{txt}
{com}.     
. quietly graph export MichiganColorsStata.png, name("michigan") width(2000) replace
{txt}
{com}. 
. //_4
. clear all
{res}{txt}
{com}.     
. use "iris.dta", clear
{txt}
{com}. 
. summarize

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
Sepal_Length {c |}{res}        150    5.843333    .8280661        4.3        7.9
{txt}{space 1}Sepal_Width {c |}{res}        150    3.057333    .4358663          2        4.4
{txt}Petal_Length {c |}{res}        150       3.758    1.765298          1        6.9
{txt}{space 1}Petal_Width {c |}{res}        150    1.199333    .7622377         .1        2.5
{txt}{space 5}Species {c |}{res}        150           2    .8192319          1          3
{txt}
{com}. //_5
. histogram Petal_Length, scheme(michigan)
{txt}(bin={res}12{txt}, start={res}1{txt}, width={res}.49166667{txt})
{res}{txt}
{com}. //_6q
. quietly graph export myhistogram.png, width(1500) replace
{txt}
{com}. //_7
. histogram Petal_Length, fcolor(%50) scheme(michigan)
{txt}(bin={res}12{txt}, start={res}1{txt}, width={res}.49166667{txt})
{res}{txt}
{com}. //_8q
. quietly graph export myhistogram2.png, width(1500) replace
{txt}
{com}. //_9
. graph bar Petal_Length, over(Species) scheme(michigan) asyvars
{res}{txt}
{com}. //_10q
. quietly graph export mybargraph.png, width(1500) replace
{txt}
{com}. //_11
. graph bar Petal_Length, over(Species) intensity(70) scheme(michigan) asyvars
{res}{txt}
{com}. //_12q
. quietly graph export mybargraph2.png, width(1500) replace
{txt}
{com}. //_13
. twoway (scatter Petal_Length Petal_Width) ///
> (lfit Petal_Length Petal_Width), ///
> scheme(michigan)
{res}{txt}
{com}. //_14q
. quietly graph export myscatter.png, width(1500) replace
{txt}
{com}. //_15
. twoway (scatter Petal_Length Petal_Width, mcolor(%30)) /// markers have 30% transparency
> (lfit Petal_Length Petal_Width), ///
> scheme(michigan)
{res}{txt}
{com}. //_16q
. quietly graph export myscatter2.png, width(1500) replace
{txt}
{com}. //_17
. graph bar Petal_Length, over(Species) scheme(michigan) asyvars legend(pos(6) rows(1))
{res}{txt}
{com}. //_18q
. quietly graph export mybargraph3.png, width(1500) replace
{txt}
{com}. //_19
. twoway (scatter Petal_Length Petal_Width, mcolor("112 32 130 %30")) /// markers are Amethyst with 30% transparency
> (lfit Petal_Length Petal_Width, lcolor("87 82 148")), /// Violet line
> scheme(michigan)
{res}{txt}
{com}. //_20q
. quietly graph export myscatter3.png, width(1500) replace
{txt}
{com}. //_21q
. 
. use "graphdemo.dta", clear
{txt}
{com}.     
. graph bar (count), ///
> over(x, axis(off)) asyvars ///
> ytitle(" ") ylabel(none) ///
> yscale(lcolor(none)) ///
> title(Michigan Graph Scheme Colors) ///
> scheme(michigan) ///
> ysize(1.5) scale(2) ///
> name(michigan, replace)
{res}{txt}
{com}. 
. graph bar (count), ///
> over(x, axis(off)) asyvars ///
> ytitle(" ") ylabel(none) ///
> yscale(lcolor(none)) ///
> title(Michigan2 Graph Scheme Colors) ///
> scheme(michigan2) ///
> ysize(1.5) scale(2) ///
> name(michigan2, replace)
{res}{txt}
{com}.     
. quietly graph export MichiganColorsStata2.png, ///
> name("michigan2") width(1500) replace
{txt}
{com}.     
. quietly graph combine michigan michigan2, ///
> colfirst cols(1) ///
> scale(.5) scheme(michigan) ///
> name(michigancombined, replace)
{txt}
{com}.     
. quietly graph export MichiganColorsStata3.png, ///
> name("michigancombined") width(1500) replace
{txt}
{com}.     
. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Desktop\GitHub\Stata\michigan-graph-scheme\index.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}16 Feb 2025, 13:03:21
{txt}{.-}
{smcl}
{txt}{sf}{ul off}