{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Box Sync\Box Sync\GitHub\Stata\michigan-graph-scheme\index.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Jan 2020, 15:14:07
{txt}
{com}. //_1
. display c(current_date)
{res} 9 Jan 2020
{txt}
{com}. //_2
. display c(current_time)
{res}15:14:07
{txt}
{com}. //_3
. 
. use "iris.dta", clear
{txt}
{com}. 
. summarize

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
Sepal_Length {c |}{res}        150    5.843333    .8280661        4.3        7.9
{txt}{space 1}Sepal_Width {c |}{res}        150    3.057333    .4358663          2        4.4
{txt}Petal_Length {c |}{res}        150       3.758    1.765298          1        6.9
{txt}{space 1}Petal_Width {c |}{res}        150    1.199333    .7622377         .1        2.5
{txt}{space 5}Species {c |}{res}        150           2    .8192319          1          3
{txt}
{com}. 
. //_4
. 
. histogram Petal_Length, scheme(michigan)
{txt}(bin={res}12{txt}, start={res}1{txt}, width={res}.49166667{txt})
{res}{txt}
{com}. 
. //_5q
.     
. quietly graph export myhistogram.png, width(500) replace
{txt}
{com}. 
. //_6
. 
. twoway (scatter Petal_Length Petal_Width) ///
> (lfit Petal_Length Petal_Width), ///
> scheme(michigan)
{res}{txt}
{com}. 
. //_7q
.     
. quietly graph export myscatter.png, width(500) replace
{txt}
{com}. 
. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Box Sync\Box Sync\GitHub\Stata\michigan-graph-scheme\index.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 9 Jan 2020, 15:14:09
{txt}{.-}
{smcl}
{txt}{sf}{ul off}