{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Box Sync\Box Sync\GitHub\Stata\michigan-graph-scheme\index.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Mar 2021, 13:54:50
{txt}
{com}. //_1
. display c(current_date)
{res} 7 Mar 2021
{txt}
{com}. //_2
. display c(current_time)
{res}13:54:50
{txt}
{com}. //_3q
. 
. clear all
{res}{txt}
{com}. 
. quietly set obs 10
{txt}
{com}. 
. generate x = _n
{txt}
{com}. 
. graph bar (count), ///
> over(x) asyvars ///
> ytitle(" ") ylabel(none) ///
> yscale(lcolor(none)) ///
> title(Michigan Graph Scheme Colors) ///
> scheme(michigan)
{res}{txt}
{com}.     
. quietly graph export MichiganColorsStata.png, width(750) replace
{txt}
{com}. 
. //_4
. 
. clear all
{res}{txt}
{com}.     
. use "iris.dta", clear
{txt}
{com}. 
. summarize

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
Sepal_Length {c |}{res}        150    5.843333    .8280661        4.3        7.9
{txt}{space 1}Sepal_Width {c |}{res}        150    3.057333    .4358663          2        4.4
{txt}Petal_Length {c |}{res}        150       3.758    1.765298          1        6.9
{txt}{space 1}Petal_Width {c |}{res}        150    1.199333    .7622377         .1        2.5
{txt}{space 5}Species {c |}{res}        150           2    .8192319          1          3
{txt}
{com}. 
. //_5
. 
. histogram Petal_Length, scheme(michigan)
{txt}(bin={res}12{txt}, start={res}1{txt}, width={res}.49166667{txt})
{res}{txt}
{com}. 
. //_6q
.     
. quietly graph export myhistogram.png, width(750) replace
{txt}
{com}. 
. //_7
. 
. graph bar Petal_Length, over(Species) scheme(michigan) asyvars
{res}{txt}
{com}. 
. //_8q
.     
. quietly graph export mybargraph.png, width(750) replace
{txt}
{com}. 
. //_9
. 
. twoway (scatter Petal_Length Petal_Width) ///
> (lfit Petal_Length Petal_Width), ///
> scheme(michigan)
{res}{txt}
{com}. 
. //_10q
.     
. quietly graph export myscatter.png, width(750) replace
{txt}
{com}. 
. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Box Sync\Box Sync\GitHub\Stata\michigan-graph-scheme\index.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 Mar 2021, 13:54:56
{txt}{.-}
{smcl}
{txt}{sf}{ul off}