{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agroganx/Box Sync/GitHub/Stata/stata-graphing/index.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}12 Nov 2019, 18:30:13
{txt}
{com}. //_1
. display c(current_date)
{res}12 Nov 2019
{txt}
{com}. //_2
. 
. use "iris.dta", clear
{txt}
{com}. 
. summarize

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
Sepal_Length {c |}{res}        150    5.843333    .8280661        4.3        7.9
{txt}{space 1}Sepal_Width {c |}{res}        150    3.057333    .4358663          2        4.4
{txt}Petal_Length {c |}{res}        150       3.758    1.765298          1        6.9
{txt}{space 1}Petal_Width {c |}{res}        150    1.199333    .7622377         .1        2.5
{txt}{space 5}Species {c |}{res}        150           2    .8192319          1          3
{txt}
{com}. 
. //_3
. 
. histogram Petal_Length
{txt}(bin={res}12{txt}, start={res}1{txt}, width={res}.49166667{txt})
{res}{txt}
{com}. 
. //_4q
.     
. quietly graph export myhistogram.png, width(500) replace
{txt}
{com}. 
. //_5
. 
. graph bar, over(Species)
{res}{txt}
{com}. 
. //_6q
.     
. quietly graph export mybargraph.png, width(500) replace
{txt}
{com}. 
. //_7
. 
. twoway scatter Petal_Length Petal_Width
{res}{txt}
{com}. 
. //_8q
.     
. quietly graph export myscatter.png, width(500) replace
{txt}
{com}. 
. //_9
. 
. recode Petal_Length ///
> (min/3.758 = 0 "below mean") ///
> (3.758/max = 1 "above mean"), ///
> generate(Petal_Group) // dichotomize Petal_Length
{txt}(150 differences between Petal_Length and Petal_Group)

{com}.     
. graph bar, over(Species) over(Petal_Group)
{res}{txt}
{com}. 
. //_10q
.     
. quietly graph export mybargraph2.png, width(500) replace
{txt}
{com}. 
. //_11
. 
. graph bar Petal_Length, over(Species)
{res}{txt}
{com}. 
. //_12q
.     
. quietly graph export mybargraph3.png, width(500) replace
{txt}
{com}. 
. //_13
. 
. twoway scatter Petal_Length Petal_Width, scheme(s1rcolor) ///
> title("Petal Length by Petal Width") ///
> xtitle("Petal Width") ytitle("Petal Width") ///
> caption("Iris Data") 
{res}{txt}
{com}. 
. //_14q
.     
. quietly graph export graphtitleslabels.png, width(500) replace
{txt}
{com}. 
. //_15
. 
. twoway scatter Petal_Length Petal_Width, scheme(economist)
{res}{txt}
{com}. 
. //_16q
.     
. quietly graph export econscatter.png, width(500) replace
{txt}
{com}. 
. //_17
. 
. twoway scatter Petal_Length Petal_Width, scheme(sj)
{res}{txt}
{com}. 
. //_18q
.     
. quietly graph export sjscatter.png, width(500) replace
{txt}
{com}. 
. //_19
. 
. twoway scatter Petal_Length Petal_Width, scheme(s1rcolor)
{res}{txt}
{com}. 
. //_20q
.     
. quietly graph export s1rcolorscatter.png, width(500) replace
{txt}
{com}. 
. //_21
. 
. twoway scatter Petal_Length Petal_Width, scheme(lean2)
{res}{txt}
{com}. 
. //_22q
.     
. quietly graph export lean2scatter.png, width(500) replace
{txt}
{com}. 
. //_23
. 
. twoway (scatter Petal_Length Petal_Width) /// 
> (lfit Petal_Length Petal_Width), scheme(michigan)
{txt}(note: scheme michigan not found, using s2color)
{res}{txt}
{com}. 
. //_24q
.     
. quietly graph export michiganscatter.png, width(500) replace
{txt}
{com}. 
. //_25
. 
. twoway (scatter Petal_Length Petal_Width, msymbol(0) mcolor(red)) ///
> (lfit Petal_Length Petal_Width), ///
> scheme(lean2) 
{p 0 4 2}
{txt}(note:  named style
0 not found in class
symbol,  default attributes used)
{p_end}
{res}{txt}
{com}. 
. //_26q
.     
. quietly graph export lean2Ascatter.png, width(500) replace
{txt}
{com}. 
. //_27
. 
. twoway scatter Sepal_Length Sepal_Width Petal_Width Petal_Length, /// 
> color(%50 %50 %50) /// transparency 
> title("Multiple Iris Characteristics") /// title
> scheme(s1rcolor) // scheme
{res}{txt}
{com}. 
. //_28q
.     
. quietly graph export s1rcolorAscatter.png, width(500) replace
{txt}
{com}. 
. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agroganx/Box Sync/GitHub/Stata/stata-graphing/index.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}12 Nov 2019, 18:30:30
{txt}{.-}
{smcl}
{txt}{sf}{ul off}