{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/Stata/data-visualization-with-Stata-the-basics/data-visualization-with-Stata-the-basics.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 7 Dec 2023, 11:46:32
{txt}
{com}. //_1
. display c(current_date)
{res} 7 Dec 2023
{txt}
{com}. //_2
. clear all
{res}{txt}
{com}. 
. use "penguins.dta", clear
{txt}
{com}. //_3
. histogram body_mass_g, title("Body Mass of Penguins") xtitle("Body Mass")
{txt}(bin={res}18{txt}, start={res}2700{txt}, width={res}200{txt})
{res}{txt}
{com}. //_4q
. quietly: graph export myhistogram.png, width(1000) replace
{txt}
{com}. //_5
. graph bar, over(species) title("Penguin Species")
{res}{txt}
{com}. //_6q
. quietly: graph export mybar1.png, width(1000) replace
{txt}
{com}. //_7
. graph bar body_mass_g, over(species) title("Body Mass of Penguin Species")
{res}{txt}
{com}. //_8q
. quietly: graph export mybar2.png, width(1000) replace
{txt}
{com}. //_9
. twoway scatter culmen_length_mm body_mass_g, ///
> title("Penguin Culmen Length by Body Mass") /// 
> xtitle("Body Mass") ///
> ytitle("Culmen Length")
{res}{txt}
{com}. //_10q
. quietly: graph export myscatter.png, width(1000) replace
{txt}
{com}. //_11
. twoway lfit culmen_length_mm body_mass_g, ///
> title("Penguin Culmen Length by Body Mass") /// 
> xtitle("Body Mass") ///
> ytitle("Culmen Length")
{res}{txt}
{com}. //_12q
. quietly: graph export mylinear.png, width(1000) replace
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/Stata/data-visualization-with-Stata-the-basics/data-visualization-with-Stata-the-basics.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 7 Dec 2023, 11:46:39
{txt}{.-}
{smcl}
{txt}{sf}{ul off}