{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/Stata/data-visualization-with-Stata-the-basics/data-visualization-with-Stata-the-basics.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 4 Feb 2022, 16:33:19
{txt}
{com}. //_1
. display c(current_date)
{res} 4 Feb 2022
{txt}
{com}. //_2
. clear all
{res}{txt}
{com}. 
. use "https://github.com/agrogan1/Stata/raw/master/data-visualization-with-Stata-the-basics/penguins.dta", clear
{txt}
{com}. //_3
. set scheme s1color // use s1color scheme
{txt}
{com}. //_4
. histogram body_mass_g, title("Body Mass of Penguins") xtitle("Body Mass")
{txt}(bin={res}18{txt}, start={res}2700{txt}, width={res}200{txt})
{res}{txt}
{com}. //_5q
. quietly: graph export myhistogram.png, width(1000) replace
{txt}
{com}. //_6
. graph bar, over(species) title("Penguin Species")
{res}{txt}
{com}. //_7q
. quietly: graph export mybar1.png, width(1000) replace
{txt}
{com}. //_8
. graph bar body_mass_g, over(species) title("Body Mass of Penguin Species")
{res}{txt}
{com}. //_9q
. quietly: graph export mybar2.png, width(1000) replace
{txt}
{com}. //_10
. twoway scatter culmen_length_mm body_mass_g, ///
> title("Penguin Culmen Length by Body Mass") /// 
> xtitle("Body Mass") ///
> ytitle("Culmen Length")
{res}{txt}
{com}. //_11q
. quietly: graph export myscatter.png, width(1000) replace
{txt}
{com}. //_12
. twoway lfit culmen_length_mm body_mass_g, ///
> title("Penguin Culmen Length by Body Mass") /// 
> xtitle("Body Mass") ///
> ytitle("Culmen Length")
{res}{txt}
{com}. //_13q
. quietly: graph export mylinear.png, width(1000) replace
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/agrogan/Desktop/GitHub/Stata/data-visualization-with-Stata-the-basics/data-visualization-with-Stata-the-basics.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 4 Feb 2022, 16:33:31
{txt}{.-}
{smcl}
{txt}{sf}{ul off}