{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Desktop\GitHub\Stata\cleaning-data-with-stata\cleaning-data-with-stata.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}14 Dec 2023, 10:14:06
{txt}
{com}. //_1
. display c(current_date)
{res}14 Dec 2023
{txt}
{com}. //_2
. display c(current_time)
{res}10:14:06
{txt}
{com}. //_3
. clear all 
{res}{txt}
{com}. //_4
. set obs 100 // 100 observations
{txt}{p}
Number of observations ({bf:_N}) was 0,
now 100.
{p_end}

{com}. //_5
. generate id = _n // random id 
{txt}
{com}. //_6
. generate age = rnormal(50,10) // random generated age
{txt}
{com}. //_7
. replace age = 200 in 1 // someone is 200 years old!
{txt}(1 real change made)

{com}. //_8
. generate happy = runiformint(1,5) // randomly generated happiness
{txt}
{com}. //_9
. replace happy = 999 in 10 // simulate a missing value
{txt}(1 real change made)

{com}. //_10
. generate somethingelse = rnormal(0, 1) // something else!
{txt}
{com}. //_11
. list in 1/10 // list first 10 observations
{txt}
     {c TLC}{hline 4}{c -}{hline 10}{c -}{hline 7}{c -}{hline 11}{c TRC}
     {c |} {res}id        age   happy   somethi~e {txt}{c |}
     {c LT}{hline 4}{c -}{hline 10}{c -}{hline 7}{c -}{hline 11}{c RT}
  1. {c |} {res} 1        200       5   -.2740025 {txt}{c |}
  2. {c |} {res} 2   41.74908       1    .3407284 {txt}{c |}
  3. {c |} {res} 3   48.99197       1    1.097281 {txt}{c |}
  4. {c |} {res} 4   41.29318       2      .99441 {txt}{c |}
  5. {c |} {res} 5   38.30437       1   -.9095201 {txt}{c |}
     {c LT}{hline 4}{c -}{hline 10}{c -}{hline 7}{c -}{hline 11}{c RT}
  6. {c |} {res} 6   65.80429       3   -.6050416 {txt}{c |}
  7. {c |} {res} 7   44.24375       2    .0133314 {txt}{c |}
  8. {c |} {res} 8   52.14927       5    .4847669 {txt}{c |}
  9. {c |} {res} 9    54.0201       5   -.9933645 {txt}{c |}
 10. {c |} {res}10     67.752     999    .5900007 {txt}{c |}
     {c BLC}{hline 4}{c -}{hline 10}{c -}{hline 7}{c -}{hline 11}{c BRC}

{com}. //_12
. describe // describe the data

{txt}Contains data
 Observations:{res}           100                  
{txt}    Variables:{res}             4                  
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:id             }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:age            }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:happy          }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{p 0 48}{bind:somethingelse  }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}{p_end}
{txt}{hline}
Sorted by: 
     Note: {res}Dataset has changed since last saved.
{txt}
{com}. //_13
. summarize // descriptive statistics

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}id {c |}{res}        100        50.5    29.01149          1        100
{txt}{space 9}age {c |}{res}        100    51.58624    18.05763    24.2431        200
{txt}{space 7}happy {c |}{res}        100       12.94    99.61267          1        999
{txt}somethinge~e {c |}{res}        100   -.0249813    1.009199  -2.277072   2.547337
{txt}
{com}. //_14
. tabulate happy // tabulation of this particular categorical variable

      {txt}happy {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}         20       20.00       20.00
{txt}          2 {c |}{res}         24       24.00       44.00
{txt}          3 {c |}{res}         15       15.00       59.00
{txt}          4 {c |}{res}         18       18.00       77.00
{txt}          5 {c |}{res}         22       22.00       99.00
{txt}        999 {c |}{res}          1        1.00      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        100      100.00
{txt}
{com}. //_15
. codebook happy // VERY detailed view of this particular categorical variable

{txt}{hline}
{res}happy{right:(unlabeled)}
{txt}{hline}

{col 19}Type: Numeric ({res}float{txt})

{col 18}Range: [{res}1{txt},{res}999{txt}]{col 55}Units: {res}1
{col 10}{txt}Unique values: {res}6{col 51}{txt}Missing .: {res}0{txt}/{res}100

{txt}{col 13}Tabulation: Freq.  Value
{col 20}{res}        20{col 32}1
{col 20}        24{col 32}2
{col 20}        15{col 32}3
{col 20}        18{col 32}4
{col 20}        22{col 32}5
{col 20}         1{col 32}999
{txt}
{com}. //_16
. keep id age happy // keep only relevant variables
{txt}
{com}. //_17
. label variable id "ID" // label variable
{txt}
{com}. //_18
. label variable age "Age in Years" // label variable
{txt}
{com}. //_19
. label variable happy "Happiness Scale" // label variable
{txt}
{com}. //_20
. label define happy 1 "Rarely" 2 "Sometimes" 3 "Often" 4 "Always" // create value label
{txt}
{com}. //_21
. label values happy happy // attach VALUE LABEL happy to VARIABLE happy
{txt}
{com}. //_22
. recode happy (999 = .) // recode values as missing
{txt}(1 changes made to {bf:happy})

{com}. //_23
. recode age (100/max = 100) // age is topcoded at 100 (may or may not be plausible)
{txt}(1 changes made to {bf:age})

{com}. //_24
. describe

{txt}Contains data
 Observations:{res}           100                  
{txt}    Variables:{res}             3                  
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:id             }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}ID{p_end}
{p 0 48}{bind:age            }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Age in Years{p_end}
{p 0 48}{bind:happy          }{txt}{bind: float   }{bind:%9.0g     }{space 1}{bind:happy    }{bind:  }{res}{res}Happiness Scale{p_end}
{txt}{hline}
Sorted by: 
     Note: {res}Dataset has changed since last saved.
{txt}
{com}. //_25
. summarize

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}id {c |}{res}        100        50.5    29.01149          1        100
{txt}{space 9}age {c |}{res}        100    50.58624     11.2362    24.2431        100
{txt}{space 7}happy {c |}{res}         99    2.979798    1.463709          1          5
{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\agrogan\Desktop\GitHub\Stata\cleaning-data-with-stata\cleaning-data-with-stata.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}14 Dec 2023, 10:14:06
{txt}{.-}
{smcl}
{txt}{sf}{ul off}